## Advanced SQL Puzzles

In [ ]:
import pandas as pd

### Puzzle 1

In [ ]:
d1 = {'item': ['Sugar', 'Bread', 'Juice', 'Soda', 'Flour']}
df1 = pd.DataFrame(data=d1)

In [ ]:
df1['Item Cart 1'] = df1['item']

In [ ]:
df1.set_index('item')

In [ ]:
df1.head()

In [ ]:
d2 = {'item': ['Sugar', 'Bread', 'Butter', 'Cheese', 'Fruit']}
df2 = pd.DataFrame(data=d2)

In [ ]:
df2['Item Cart 2'] = df2['item']

In [ ]:
df2.head()

In [ ]:
df2.set_index('item')

In [ ]:
df3 = df1.merge(df2, how="outer")[['Item Cart 1', 'Item Cart 2']]

In [ ]:
df3

### Puzzle 2

In [4]:
import numpy as np
import pandas as pd

In [85]:
d = {'Employee ID': [1001, 2002, 3003, 4004, 5005, 6006, 7007],
     'Manager ID': [np.nan, 1001, 1001, 2002, 2002, 2002, 5005],
     'Job Title': ['President', 'Director', 'Office Manager', 'Engineer', 'Engineer', 'Engineer', "Intern"]}
df = pd.DataFrame(data=d, dtype=np.int16)

C:\Users\the_r\AppData\Local\Temp/ipykernel_5464/2033519502.py:4: FutureWarning: Could not cast to int16, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  df = pd.DataFrame(data=d, dtype=np.int16)

In [86]:
df.head()

   Employee ID Manager ID       Job Title
0         1001        NaN       President
1         2002       1001        Director
2         3003       1001  Office Manager
3         4004       2002        Engineer
4         5005       2002        Engineer

In [87]:
df[df["Employee ID"] == 1001]["Manager ID"].values.any()

nan

In [88]:
df[df["Employee ID"] == 2002]["Manager ID"].values.any()

1001

In [110]:
def checkDeep(EmployeeID, c):
    if df[df["Employee ID"] == EmployeeID]["Manager ID"].isnull().values.any():
        return c
    else:
        c = checkDeep(df[df["Employee ID"] == EmployeeID]["Manager ID"].values.any(), c+1)
        return c

In [112]:
df['Depth'] = df['Employee ID'].apply(lambda x: checkDeep(x, c=0))

In [114]:
df.head()

   Employee ID Manager ID       Job Title  Depth
0         1001        NaN       President      0
1         2002       1001        Director      1
2         3003       1001  Office Manager      1
3         4004       2002        Engineer      2
4         5005       2002        Engineer      2

### Puzzle 3

In [116]:
d = {'Customer ID': [1001, 1001, 1001, 1001, 2002, 3003, 3003, 4004],
     'Order ID ': [1, 2, 3, 4, 5, 6, 7, 8],
     'Delivery State': ['CA', 'TX', 'TX', 'TX', 'WA', 'CA', "CA", 'TX'],
     'Amount': ["$340", '$950', '$670', '$860', '$320', '$650', '$830', '$120']}
df = pd.DataFrame(data=d, dtype=np.int16)

C:\Users\the_r\AppData\Local\Temp/ipykernel_5464/1119302731.py:5: FutureWarning: Could not cast to int16, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  df = pd.DataFrame(data=d, dtype=np.int16)

In [117]:
df.head()

   Customer ID  Order ID  Delivery State Amount
0         1001          1             CA   $340
1         1001          2             TX   $950
2         1001          3             TX   $670
3         1001          4             TX   $860
4         2002          5             WA   $320

In [122]:
df[df['Delivery State'] == 'TX'].head(len(df[df['Delivery State'] == 'CA']))

   Customer ID  Order ID  Delivery State Amount
1         1001          2             TX   $950
2         1001          3             TX   $670
3         1001          4             TX   $860

### Puzzle 4

In [123]:
d = {'Customer ID': [1001, 1001, 1001, 2002, 2002, 3003],
     'Type': ["Cellular", "Work", "Home", "Cellular", "Work", "Cellular"],
     'Phone Number': ['555-897-5421', '555-897-6542', '555-698-9874', '555-963-6544', '555-812-9856', '555-987-6541']}
df = pd.DataFrame(data=d, dtype=np.int16)

C:\Users\the_r\AppData\Local\Temp/ipykernel_5464/3001497981.py:4: FutureWarning: Could not cast to int16, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  df = pd.DataFrame(data=d, dtype=np.int16)

In [124]:
df.head()

   Customer ID      Type  Phone Number
0         1001  Cellular  555-897-5421
1         1001      Work  555-897-6542
2         1001      Home  555-698-9874
3         2002  Cellular  555-963-6544
4         2002      Work  555-812-9856

In [126]:
df.pivot(index='Customer ID', columns='Type', values='Phone Number')

Type             Cellular          Home          Work
Customer ID
1001         555-897-5421  555-698-9874  555-897-6542
2002         555-963-6544           NaN  555-812-9856
3003         555-987-6541           NaN           NaN

### Puzzle 7

In [127]:
d = {'Customer ID': [1001, 1001, 1001, 1001, 2002, 2002, 2002, 3003, 3003, 4004],
     'Type': ["Geologist", "Astrogator", "Biochemist", "Technician", "Surgeon", "Machinist", "Geologist", "Geologist", "Astrogator", "Selenologist"]}
df = pd.DataFrame(data=d, dtype=np.int16)

C:\Users\the_r\AppData\Local\Temp/ipykernel_5464/1876144463.py:3: FutureWarning: Could not cast to int16, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  df = pd.DataFrame(data=d, dtype=np.int16)

In [130]:
d = {'Description': ["Geologist", "Astrogator", "Technician"]}
requrements = pd.DataFrame(data=d, dtype=np.int16)

C:\Users\the_r\AppData\Local\Temp/ipykernel_5464/3707353610.py:2: FutureWarning: Could not cast to int16, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  requrements = pd.DataFrame(data=d, dtype=np.int16)

In [129]:
df.head(10)

   Customer ID          Type
0         1001     Geologist
1         1001    Astrogator
2         1001    Biochemist
3         1001    Technician
4         2002       Surgeon
5         2002     Machinist
6         2002     Geologist
7         3003     Geologist
8         3003    Astrogator
9         4004  Selenologist

In [132]:
requrements.head()

  Description
0   Geologist
1  Astrogator
2  Technician

In [135]:
requrements['Description'].values

array(['Geologist', 'Astrogator', 'Technician'], dtype=object)

### Puzzle 8

In [152]:
d = {'Workflow': ["Alpha", "Bravo", "Charlie", "Delta"],
     'Case 1': [0, 0, 1, 0],
     'Case 2': [0, 1, 0, 0],
     'Case 3': [0, 1, 0, 0]}
df = pd.DataFrame(data=d, dtype=np.int16)

C:\Users\the_r\AppData\Local\Temp/ipykernel_5464/3282193271.py:5: FutureWarning: Could not cast to int16, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  df = pd.DataFrame(data=d, dtype=np.int16)

In [154]:
df['Passed'] = df['Case 1'] +  df['Case 2'] + df['Case 3']

In [156]:
dfResult = df[['Workflow', 'Passed']]

In [157]:
dfResult.head()

  Workflow  Passed
0    Alpha       0
1    Bravo       2
2  Charlie       1
3    Delta       0

### Puzzle 10

In [ ]:
(5),(6),(10),(10),(13),
(14),(17),(20),(81),(90),(76);

In [158]:
r = [5, 6, 10, 10, 13, 14, 17, 20, 81, 90, 76]
ser = pd.Series(r, copy=False)

In [159]:
ser.mean()

31.09090909090909

In [163]:
ser.median()

14.0

In [161]:
ser.mode()

0    10
dtype: int64